rails-backend/app/controllers/api/texts_controller.rb

    def index
      # 全ユーザーのアイテムを閲覧可能（管理者のアイテムを共有）
      items = Item.where(item_type: params[:type]).order(:created_at)
---
SELECT "items".* FROM "items" WHERE "items"."item_type" = ? ORDER BY "items"."created_at" ASC  [["item_type", "event"]]